// requires ================================================= //
// framework Express ---------------------------------------- //
const express = require("express");
// utils ---------------------------------------------------- //
const { getUser, postUser } = require("./methods");

// constants ================================================ //
const ROUTER = express.Router();

// main ===================================================== //
ROUTER.route("/")
    .get(getUser)    // получить данные пользователя (по полям)
    .post(postUser); // изменить данные пользователя (по полям)

// export =================================================== //
module.exports = ROUTER;